raw/res-OLTP-RO-memory-disk-samsung-8t-wt/mongowt.BP180/thr84/res.txt
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 84
Report intermediate results every 10 second(s)
Initializing random number generator from current time


setting write concern to 0
Initializing worker threads...

Threads started!

[  10s] threads: 84, tps: 7849.64, reads: 109962.00, writes: 0.00, response time: 15.38ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 84, tps: 7932.30, reads: 111060.69, writes: 0.00, response time: 15.27ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 84, tps: 7934.90, reads: 111088.86, writes: 0.00, response time: 15.24ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 84, tps: 7945.29, reads: 111232.40, writes: 0.00, response time: 15.22ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 84, tps: 7944.50, reads: 111222.40, writes: 0.00, response time: 15.29ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 84, tps: 7969.90, reads: 111575.54, writes: 0.00, response time: 15.25ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 84, tps: 7937.10, reads: 111123.02, writes: 0.00, response time: 15.26ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 84, tps: 7946.50, reads: 111254.11, writes: 0.00, response time: 15.22ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 84, tps: 7936.50, reads: 111102.50, writes: 0.00, response time: 15.28ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 84, tps: 7958.50, reads: 111423.91, writes: 0.00, response time: 15.19ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 84, tps: 7951.30, reads: 111319.65, writes: 0.00, response time: 15.20ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 84, tps: 7950.40, reads: 111298.17, writes: 0.00, response time: 15.18ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 84, tps: 7948.30, reads: 111280.97, writes: 0.00, response time: 15.23ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 84, tps: 7943.90, reads: 111214.60, writes: 0.00, response time: 15.24ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 84, tps: 7945.20, reads: 111228.61, writes: 0.00, response time: 15.27ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 84, tps: 7932.40, reads: 111057.58, writes: 0.00, response time: 15.28ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 84, tps: 7958.40, reads: 111419.30, writes: 0.00, response time: 15.27ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 84, tps: 7939.00, reads: 111142.09, writes: 0.00, response time: 15.25ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 84, tps: 7930.80, reads: 111034.41, writes: 0.00, response time: 15.27ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 84, tps: 7904.00, reads: 110660.43, writes: 0.00, response time: 15.27ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 84, tps: 7917.00, reads: 110831.22, writes: 0.00, response time: 15.27ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 84, tps: 7908.20, reads: 110712.75, writes: 0.00, response time: 15.34ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 84, tps: 7911.80, reads: 110766.14, writes: 0.00, response time: 15.25ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 84, tps: 7913.60, reads: 110794.50, writes: 0.00, response time: 15.28ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 84, tps: 7915.50, reads: 110819.16, writes: 0.00, response time: 15.27ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 84, tps: 7911.80, reads: 110759.64, writes: 0.00, response time: 15.27ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 84, tps: 7942.80, reads: 111200.89, writes: 0.00, response time: 15.23ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 84, tps: 7928.00, reads: 110992.80, writes: 0.00, response time: 15.29ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 84, tps: 7939.40, reads: 111154.51, writes: 0.00, response time: 15.25ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 84, tps: 7924.63, reads: 110948.00, writes: 0.00, response time: 15.31ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            33317200
        write:                           0
        other:                           2379800
        total:                           35697000
    transactions:                        2379800 (7932.46 per sec.)
    read/write requests:                 33317200 (111054.47 per sec.)
    other operations:                    2379800 (7932.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0077s
    total number of events:              2379800
    total time taken by event execution: 25196.2956s
    response time:
         min:                                  3.48ms
         avg:                                 10.59ms
         max:                                 35.71ms
         approx.  95 percentile:              15.26ms

Threads fairness:
    events (avg/stddev):           28330.9524/48.21
    execution time (avg/stddev):   299.9559/0.00